//
//  Constants.swift
//  Trains
//
//  Created by Алексей Непряхин on 29.07.2025.
//

import Foundation

enum Constants {
    static let apikey = "5cd7ea28-59b4-49b2-99f2-ae54c4a7b6f3"
    
    static let text1 = "Оферта на оказание образовательных услуг дополнительного образования \nЯндекс.Практикум для физических лиц"
    static let text2 = "Данный документ является действующим, если расположен по адресу: https://yandex.ru/legal/practicum_offer \nРоссийская Федерация, город Москва"
    static let text3 = "1. ТЕРМИНЫ"
    static let text4 = "Понятия, используемые в Оферте, означают следующее: \nАвторизованные адреса — адреса электронной почты каждой Стороны. Авторизованным адресом Исполнителя является адрес электронной почты, указанный в разделе 11 Оферты. Авторизованным адресом Студента является адрес электронной почты, указанный Студентом в Личном кабинете. \nВводный курс — начальный Курс обучения по представленным на Сервисе Программам обучения в рамках выбранной Студентом Профессии или Курсу, рассчитанный на определенное количество часов самостоятельного обучения, который предоставляется Студенту единожды при регистрации на Сервисе на безвозмездной основе. В процессе обучения в рамках Вводного курса Студенту предоставляется возможность ознакомления с работой Сервиса и определения возможности Студента продолжить обучение в рамках Полного курса по выбранной Студентом Программе обучения. Точное количество часов обучения в рамках Вводного курса зависит от выбранной Студентом Профессии или Курса и определяется в Программе обучения, размещенной на Сервисе. Максимальный срок освоения Вводного курса составляет 1 (один) год с даты начала обучения."
}
